reference_simulation/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0   2   0) //0
    (4   2   0) //1
    (4   5   0) //2
    (0   5   0) //3
    (0   2   1) //4
    (4   2   1) //5
    (4   5   1) //6
    (0   5   1) //7

    (22  2   0) //8
    (22  5   0) //9
    (22  2   1) //10
    (22  5   1) //11

    (4   0   0) //12
    (22  0   0) //13
    (4   0   1) //14
    (22  0   1) //15
);

blocks
(
    hex (0  1  2  3  4  5  6  7) (80 60 1) simpleGrading (1 1 1)
    hex (1  8  9  2  5  10 11 6) (360 60 1) simpleGrading (1 1 1)
    hex (12 13 8  1  14 15 10 5) (360 40 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    walls
    {
        type wall;
        faces
        (
            (3 7 6 2)
            (2 6 11 9)
            (0 4 5 1)
            (12 14 15 13)
            (12 14 5 1)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (8 10 11 9)
            (13 15 10 8)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (1 2 9 8)
            (12 1 8 13)
            (4 5 6 7)
            (5 10 11 6)
            (14 15 10 5)
        );
    }
);

// ************************************************************************* //
